# CutByUpperLevel Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassZone..::..CutByUpperLevel Property
MassZone Class See Also
---
Indicates the relationship between the MassZone and its upper level.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public MassZoneLevelCutState CutByUpperLevel { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CutByUpperLevel As MassZoneLevelCutState
	Get
```

Visual C++
---
```text
public:
property MassZoneLevelCutState CutByUpperLevel {
	MassZoneLevelCutState get ();
}
```

# See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace